// 사전 순서로 비교
if ("x54321" > "x5678") {
    print '문자열 "x54321"은 문자열 "x5678"보다 크다.';
} else {
    print '문자열 "x54321"은 문자열 "x5678"보다 크지 않다.';
}

// 숫자 순서로 비교
if ("54321" > "5678") {
    print '문자열 "54321"은 문자열 "5678"보다 크다.';
} else {
    print '문자열 "54321"은 문자열 "5678"보다 크지 않다.';
}

// 사전 순서로 비교
if ('6 pack' < '55 card stud') {
    print '문자열 "6 pack"은 문자열 "55 card stud"보다 작다.';
} else {
    print '문자열 "6 pack"은 문자열 "55 card stud"보다 작지 않다.';
}

// 숫자 순서로 비교
if ('6 pack' < 55) {
    print '문자열 "6 pack"은 숫자 55보다 작다.';
} else {
    print '문자열 "6 pack"은 숫자 55보다 작지 않다.';
}